#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
google_data_catalog_tag_template.data_ingestion: Refreshing state... [id=projects/ml-project-210100/locations/asia-northeast1/tagTemplates/data_ingestion]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_data_catalog_tag_template.data_ingestion must be replaced
-/+ resource "google_data_catalog_tag_template" "data_ingestion" {
      + force_delete    = false
      ~ id              = "projects/ml-project-210100/locations/asia-northeast1/tagTemplates/data_ingestion" -> (known after apply)
      ~ name            = "projects/ml-project-210100/locations/asia-northeast1/tagTemplates/data_ingestion" -> (known after apply)
      ~ project         = "ml-project-210100" -> (known after apply)
      ~ region          = "asia-northeast1" -> (known after apply)
        # (2 unchanged attributes hidden)

      - fields { # forces replacement
          - description  = "Data License" -> null
          - display_name = "License" -> null
          - field_id     = "license" -> null
          - is_required  = true -> null
          - name         = "projects/ml-project-210100/locations/asia-northeast1/tagTemplates/data_ingestion/fields/license" -> null
          - order        = 0 -> null

          - type {
              - primitive_type = "STRING" -> null
            }
        }
      + fields { # forces replacement
          + description  = "Data License"
          + display_name = "License"
          + field_id     = "license"
          + is_required  = true
          + name         = (known after apply)
          + order        = 0

          + type {
              + primitive_type = "STRING"
            }
        }
      - fields { # forces replacement
          - description  = "End-time of most recent ingestion job" -> null
          - display_name = "Last ETL Job End" -> null
          - field_id     = "latest_job_end_datetime" -> null
          - is_required  = false -> null
          - name         = "projects/ml-project-210100/locations/asia-northeast1/tagTemplates/data_ingestion/fields/latest_job_end_datetime" -> null
          - order        = 10 -> null

          - type {
              - primitive_type = "TIMESTAMP" -> null
            }
        }
      + fields { # forces replacement
          + description  = "End-time of most recent ingestion job"
          + display_name = "Last ETL Job End"
          + field_id     = "latest_job_end_datetime"
          + is_required  = false
          + name         = (known after apply)
          + order        = 10

          + type {
              + primitive_type = "TIMESTAMP"
            }
        }
      - fields { # forces replacement
          - description  = "How long the most recent ETL job was running" -> null
          - display_name = "Last ETL Job Runtime" -> null
          - field_id     = "latest_job_run_time" -> null
          - is_required  = false -> null
          - name         = "projects/ml-project-210100/locations/asia-northeast1/tagTemplates/data_ingestion/fields/latest_job_run_time" -> null
          - order        = 9 -> null

          - type {
              - primitive_type = "STRING" -> null
            }
        }
      + fields { # forces replacement
          + description  = "How long the most recent ETL job was running"
          + display_name = "Last ETL Job Runtime"
          + field_id     = "latest_job_run_time"
          + is_required  = false
          + name         = (known after apply)
          + order        = 9

          + type {
              + primitive_type = "STRING"
            }
        }
      - fields { # forces replacement
          - description  = "Name of the user to contact regarding ingestion issues and questions" -> null
          - display_name = "Data Ingestion Owner" -> null
          - field_id     = "data_ingestion_owner" -> null
          - is_required  = false -> null
          - name         = "projects/ml-project-210100/locations/asia-northeast1/tagTemplates/data_ingestion/fields/data_ingestion_owner" -> null
          - order        = 13 -> null

          - type {
              - primitive_type = "STRING" -> null
            }
        }
      + fields { # forces replacement
          + description  = "Name of the user to contact regarding ingestion issues and questions"
          + display_name = "Data Ingestion Owner"
          + field_id     = "data_ingestion_owner"
          + is_required  = false
          + name         = (known after apply)
          + order        = 13

          + type {
              + primitive_type = "STRING"
            }
        }
      - fields { # forces replacement
          - description  = "Specifies how many errors have occurred during most recent ETL job" -> null
          - display_name = "Number of Errors" -> null
          - field_id     = "errors" -> null
          - is_required  = false -> null
          - name         = "projects/ml-project-210100/locations/asia-northeast1/tagTemplates/data_ingestion/fields/errors" -> null
          - order        = 1 -> null

          - type {
              - primitive_type = "DOUBLE" -> null
            }
        }
      + fields { # forces replacement
          + description  = "Specifies how many errors have occurred during most recent ETL job"
          + display_name = "Number of Errors"
          + field_id     = "errors"
          + is_required  = false
          + name         = (known after apply)
          + order        = 1

          + type {
              + primitive_type = "DOUBLE"
            }
        }
      - fields { # forces replacement
          - description  = "Specifies how many warnings have occurred during most recent ETL job" -> null
          - display_name = "Number of Warnings" -> null
          - field_id     = "warnings" -> null
          - is_required  = false -> null
          - name         = "projects/ml-project-210100/locations/asia-northeast1/tagTemplates/data_ingestion/fields/warnings" -> null
          - order        = 2 -> null

          - type {
              - primitive_type = "DOUBLE" -> null
            }
        }
      + fields { # forces replacement
          + description  = "Specifies how many warnings have occurred during most recent ETL job"
          + display_name = "Number of Warnings"
          + field_id     = "warnings"
          + is_required  = false
          + name         = (known after apply)
          + order        = 2

          + type {
              + primitive_type = "DOUBLE"
            }
        }
      - fields { # forces replacement
          - description  = "Specifies the source of the data asset" -> null
          - display_name = "Data Sources of ETL Job" -> null
          - field_id     = "data_sources" -> null
          - is_required  = false -> null
          - name         = "projects/ml-project-210100/locations/asia-northeast1/tagTemplates/data_ingestion/fields/data_sources" -> null
          - order        = 8 -> null

          - type {
              - primitive_type = "STRING" -> null
            }
        }
      + fields { # forces replacement
          + description  = "Specifies the source of the data asset"
          + display_name = "Data Sources of ETL Job"
          + field_id     = "data_sources"
          + is_required  = false
          + name         = (known after apply)
          + order        = 8

          + type {
              + primitive_type = "STRING"
            }
        }
      - fields { # forces replacement
          - description  = "Specifies whether all source data contains PII" -> null
          - display_name = "PII Data Sources" -> null
          - field_id     = "data_sources_have_pii" -> null
          - is_required  = false -> null
          - name         = "projects/ml-project-210100/locations/asia-northeast1/tagTemplates/data_ingestion/fields/data_sources_have_pii" -> null
          - order        = 6 -> null

          - type {
              - primitive_type = "BOOL" -> null
            }
        }
      + fields { # forces replacement
          + description  = "Specifies whether all source data contains PII"
          + display_name = "PII Data Sources"
          + field_id     = "data_sources_have_pii"
          + is_required  = false
          + name         = (known after apply)
          + order        = 6

          + type {
              + primitive_type = "BOOL"
            }
        }
      - fields { # forces replacement
          - description  = "Specifies whether all source data was approved" -> null
          - display_name = "Data Sources Approved" -> null
          - field_id     = "data_sources_approved_all" -> null
          - is_required  = false -> null
          - name         = "projects/ml-project-210100/locations/asia-northeast1/tagTemplates/data_ingestion/fields/data_sources_approved_all" -> null
          - order        = 7 -> null

          - type {
              - primitive_type = "BOOL" -> null
            }
        }
      + fields { # forces replacement
          + description  = "Specifies whether all source data was approved"
          + display_name = "Data Sources Approved"
          + field_id     = "data_sources_approved_all"
          + is_required  = false
          + name         = (known after apply)
          + order        = 7

          + type {
              + primitive_type = "BOOL"
            }
        }
      - fields { # forces replacement
          - description  = "The number of rows that need reprocessing" -> null
          - display_name = "Rows to Reprocess" -> null
          - field_id     = "rows_for_reprocessing" -> null
          - is_required  = false -> null
          - name         = "projects/ml-project-210100/locations/asia-northeast1/tagTemplates/data_ingestion/fields/rows_for_reprocessing" -> null
          - order        = 3 -> null

          - type {
              - primitive_type = "DOUBLE" -> null
            }
        }
      + fields { # forces replacement
          + description  = "The number of rows that need reprocessing"
          + display_name = "Rows to Reprocess"
          + field_id     = "rows_for_reprocessing"
          + is_required  = false
          + name         = (known after apply)
          + order        = 3

          + type {
              + primitive_type = "DOUBLE"
            }
        }
      - fields { # forces replacement
          - description  = "The number of rows/records added during the most recent ETL job run" -> null
          - display_name = "Rows Added" -> null
          - field_id     = "rows_added" -> null
          - is_required  = false -> null
          - name         = "projects/ml-project-210100/locations/asia-northeast1/tagTemplates/data_ingestion/fields/rows_added" -> null
          - order        = 4 -> null

          - type {
              - primitive_type = "DOUBLE" -> null
            }
        }
      + fields { # forces replacement
          + description  = "The number of rows/records added during the most recent ETL job run"
          + display_name = "Rows Added"
          + field_id     = "rows_added"
          + is_required  = false
          + name         = (known after apply)
          + order        = 4

          + type {
              + primitive_type = "DOUBLE"
            }
        }
      - fields { # forces replacement
          - description  = "The number of rows/records ingested/processed during the most recent ETL job run" -> null
          - display_name = "Rows Processed" -> null
          - field_id     = "rows_processed" -> null
          - is_required  = false -> null
          - name         = "projects/ml-project-210100/locations/asia-northeast1/tagTemplates/data_ingestion/fields/rows_processed" -> null
          - order        = 5 -> null

          - type {
              - primitive_type = "DOUBLE" -> null
            }
        }
      + fields { # forces replacement
          + description  = "The number of rows/records ingested/processed during the most recent ETL job run"
          + display_name = "Rows Processed"
          + field_id     = "rows_processed"
          + is_required  = false
          + name         = (known after apply)
          + order        = 5

          + type {
              + primitive_type = "DOUBLE"
            }
        }
      - fields { # forces replacement
          - description  = "The start-time of most recent ETL job" -> null
          - display_name = "Last ETL Job Start" -> null
          - field_id     = "latest_job_start_datetime" -> null
          - is_required  = false -> null
          - name         = "projects/ml-project-210100/locations/asia-northeast1/tagTemplates/data_ingestion/fields/latest_job_start_datetime" -> null
          - order        = 11 -> null

          - type {
              - primitive_type = "TIMESTAMP" -> null
            }
        }
      + fields { # forces replacement
          + description  = "The start-time of most recent ETL job"
          + display_name = "Last ETL Job Start"
          + field_id     = "latest_job_start_datetime"
          + is_required  = false
          + name         = (known after apply)
          + order        = 11

          + type {
              + primitive_type = "TIMESTAMP"
            }
        }
      - fields { # forces replacement
          - description  = "The status of the last ingestion job" -> null
          - display_name = "Last ETL Job Status" -> null
          - field_id     = "latest_job_status" -> null
          - is_required  = false -> null
          - name         = "projects/ml-project-210100/locations/asia-northeast1/tagTemplates/data_ingestion/fields/latest_job_status" -> null
          - order        = 12 -> null

          - type {
              - enum_type {
                  - allowed_values {
                      - display_name = "completed" -> null
                    }
                  - allowed_values {
                      - display_name = "failed" -> null
                    }
                  - allowed_values {
                      - display_name = "interrupted" -> null
                    }
                  - allowed_values {
                      - display_name = "partial" -> null
                    }
                  - allowed_values {
                      - display_name = "queued" -> null
                    }
                  - allowed_values {
                      - display_name = "retrying" -> null
                    }
                  - allowed_values {
                      - display_name = "running" -> null
                    }
                  - allowed_values {
                      - display_name = "skipped" -> null
                    }
                }
            }
        }
      + fields { # forces replacement
          + description  = "The status of the last ingestion job"
          + display_name = "Last ETL Job Status"
          + field_id     = "latest_job_status"
          + is_required  = false
          + name         = (known after apply)
          + order        = 12

          + type {
              + enum_type {
                  + allowed_values {
                      + display_name = "failed"
                    }
                  + allowed_values {
                      + display_name = "interrupted"
                    }
                  + allowed_values {
                      + display_name = "partial"
                    }
                  + allowed_values {
                      + display_name = "queued"
                    }
                  + allowed_values {
                      + display_name = "retrying"
                    }
                  + allowed_values {
                      + display_name = "running"
                    }
                  + allowed_values {
                      + display_name = "skipped"
                    }
                }
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>